/*******************************************************************************************************
** Descriptions:		CRC calculating function for SD operation
********************************************************************************************************/

#ifndef 	__sdcrc_h
#define 	__sdcrc_h

extern uint16 SD_GetCRC16(uint8 *pSource,uint16 len);	//得到len个字节的CRC16

extern uint8 SD_GetCmdByte6(uint8 cmd,uint8 *param);	//得到SD命令的第6个字节: CRC7 + 停止位1

extern uint8 SD_GetCRC7(uint8 *pSource,uint16 len);		//得到len个字节的CRC7

#endif
/*
================================================================================
============================End of file=========================================        
================================================================================
*/



